package com.npgames.insight.application;

public class Constants {

    public interface TestText {
        String TEST_TEXT = "Вы сидите на капитанском мостике, изучая показания приборов. Точнее говоря, делаете вид, так как ничего в них не понимаете. Наверное, придётся торчать здесь часами, чтобы вновь научиться управлять своим кораблём. \n" +
                "\n" +
                "В помещении прохладно и темно — после полученных повреждений, энергия экономится на всём. Повезло, что бережливый бортовой компьютер искусственную гравитацию не отключил. Обдувающий лицо кондиционированный воздух почти ледяной. Даёте команду отрегулировать климат-кон- троль, на что компьютер огрызается нехваткой ресурсов. \n" +
                "\n" +
                "Всего несколько часов прошло после пробуждения и вы ещё не полностью восстановились. Сложно сказать, в чём здесь больше вины — влияния аномальной зоны или длительного сна. Чувствуется слабость в мышцах, движения угловатые и немного не скоординированные. Запястья перевязаны эластичными бинтами — ещё недавно из них торчали иглы по которым в тело поступал физраствор. \n" +
                "\n" +
                "Вы уже знаете всё о поломке корабля и необходи - мости срочного ремонта. Грэм быстро вводит в курс дела. Оказывается денег на вашем счету нет и были ли они там вы не помните. А это значит — вы застряли в этой солнечной системе. Но вам ещё повезло. «Крысобой» могло запросто выкинуть где-нибудь в межзвездном пространстве и тогда вас ждало бы бесконечное падение в бездну. Годы или деся- тилетия в надежде на то, что аварийный сигнал маяка будет кем-нибудь случайно замечен. Если вообще будет замечен. Сколько таких затерявшихся кораблей болтается сейчас по Вселенной? \n" +
                "Починка — первая и наиболее важная проблема, которую надо решить и как можно быстрее. А решение проблем, вроде бы как раз ваша специализация. \n" +
                "\n" +
                "— Найди какую-нибудь работёнку,— приказали вы исину уже через полчаса после пробуждения. Между приступом головной боли и спазмами в горящих огнём лёгких. Медлить вы не любили: — Наверняка и здесь кого-нибудь надо прищучить. \n" +
                "\n" +
                "Грэм выполнил приказ на удивление быстро и теперь «Крысобой» держит курс на один из астероидов. За собой он тащит развернутый энергетический зонтик, словно ранен- ный зверь, подволакивающий перебитую ногу. Астероид, к счастью, оказался недалеко от точки выхода космобота в эту систему. С него, ваш потенциальный будущий клиент, рассылает в вакуум запросы о помощи. \n" +
                "\n" +
                "— Местные стражи не очень-то к нему спешат,— заме- чаете вы.— Видать других дел полно. \n" +
                "\n" +
                "Картина, впрочем, обычная для дальних миров. Что ж, благодаря таким как они, такие как вы всегда заработают себе на хлеб. Главное до прилета собрать мозги в кучу и привести себя в рабочее состояние.\n" +
                "\n" +
                "— Расскажи ещё раз,— обращаетесь к Грэму. \n" +
                "\n" +
                "Предыдущие его объяснения из-за головной боли похо- дили на кашу, но теперь сознание достаточно прояснилось.\n" +
                "\n" +
                "— Шесть дней сна, хозяин,— повторяет исин.— После скачка, ремонтным системам пришлось долго восстанавливать жизнедеятельность корабля. Ты был погружён в состояние близкое к анабиозу и находился в спасательной капсуле.\n" +
                "\n" +
                "— А ты чем всё это время занимался? \n" +
                "\n" +
                "— Я тоже спал,— в голосе исина послышалось недо- вольство.— Ты сам перевёл меня в режим ожидания ещё до гиперпрыжка. \n" +
                "\n" +
                "Вы этого не помните, впрочем, как и многого другого. Прошлое как в тумане — какие-то обрывки перемешанных воспоминаний. И имя-то своё вспомнили с трудом. Или его подсказал Грэм? Всё вокруг кажется непривычным и в тоже время знакомым до малейших деталей. \n" +
                "\n" +
                "— Когда моя память восстановится? — этот вопрос волнует вас сейчас больше всего. \n" +
                "\n" +
                "— Сложно сказать,— Грэм, казалось, пожимает вирту- альными плечами.— Физически ты здоров, у тебя что-то похожее на психологическую травму. Может через пять минут оклемаешься, а может и никогда. Воспоминания будут приходить постепенно и иногда внезапно. Например, если сделаешь что-то привычное.— И добавил с укором: — Если бы не отключил меня, я бы разобрался в поломках намного быстрее и давно разбудил тебя. Автоматика всё делает по инструкции и слишком перестраховывается.\n" +
                "\n" +
                "— Понятно,— перебиваете его.\n" +
                "— Сам-то не повредился?\n" +
                "\n" +
                " Исин предпочитает не отвечать на этот вопрос. ";
    }
}
